# 赋值运算符 "="

"""
1. 运算执行顺序是从右到左
2. 支持链式赋值：a=b=c=20
3. 支持参数赋值：+=、-=、/=、//=、%=
4. 支持系列解包赋值：a,b,c=20,30,40
"""

print('#----------赋值------------') 
i=3+4
print(i)


print('#----------链式赋值------------') 
a=b=c=20
print(a,id(a))
print(b,id(b))
print(c,id(c))
# 这里ID是记录在内存里的信息


print('#----------参数赋值------------') 
a=20
a+=30   # 相当于a=a+30
print(a)
a-=10   # 相当于a=a-10
print(a)
a*=2    # 相当于a=a*2
print(a,type(a))
a/=3
print(a,type(a))
a//=2
print(a)
a%=3
print(a,type(a))


print('#----------解包赋值------------')
a,b,c=20,30,40
print(a,b,c)
# a,b=20,30,40  报错：左右变量的数量不对应


print('#----------交换两个变量的值------------')
a,b=10,20
print('交换之前',a,b)
a,b=b,a
print('交换之后',a,b)