# 位运算符

"""
将数据转成二进制行计算
1） 位与&     对应数位都是1，结果数位才是1，否正为0
2） 位与|     对应数位都是0，结果数位才是0，或者位1
3） 左移位运算符<<      高位溢出舍弃，低位补0
4） 右移位运算符>>      低位溢出舍弃，高位补0
"""

"""
010 009 008 007 006 005 004 003 002 001     十进制      结果
         0   0   0   0   0   1   0   0        4
         0   0   0   0   1   0   0   0        8
         0   0   0   0   0   0   0   0       4&8        0

         0   0   0   0   0   1   0   0        4
         0   0   0   0   1   0   0   0        8
         0   0   0   0   1   1   0   0       4|8        12

         0   0   0   0   0   1   0   0        4
     0   0   0   0   0   1   0   0         4左移一位
         0   0   0   0   1   0   0   0     高位舍弃低位补0，结果为8，相当于乘以2

         0   0   0   0   0   1   0   0        4
             0   0   0   0   0   1   0   0   4右移一位
         0   0   0   0   0   0   1   0     低位溢出舍弃，高位补0，结果为2，相对于除2
"""

print(4&8)  # 0
print(4|8)  # 12

print(4<<1) # 8  向左移1位
print(4<<2) # 16 向左移2位

print(4>>1) # 2  向右移1位
print(4>>2) # 1 向右移2位